app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"  ORDER BY created_at DESC
---
  def index
    @issues = Issue.all.order("created_at DESC")

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @issues = Issue.find(params[:id])